In [1]:
import pandas

In [2]:
prahadata = pandas.read_csv('zam_praha.csv')
prahadata['city'] = 'Praha'

plzendata = pandas.read_csv('zam_plzeň.csv')
plzendata['city'] = 'Plzen'

liberecdata = pandas.read_csv('zam_liberec.csv')
liberecdata['city'] = 'Liberec'

In [4]:
zamestnanci = pandas.concat([prahadata, plzendata, liberecdata])
zamestnanci.head()

      jmeno prijimeni   telefonni_cislo  cislo_zamestnance   city
0     Brian      Hall  +421 949 656 098                 30  Praha
1     Marta  Kolářová       730 456 163                 32  Praha
2      John   Moravec       725 092 179                 33  Praha
3  Dominika   Kopecká       722 747 626                 34  Praha
4    Marcel     Hájek  +421 902 928 669                 35  Praha

In [6]:
platy = pandas.read_csv('platy_2021_02.csv')

zamestnanecplat = pandas.merge(zamestnanci, platy, on='cislo_zamestnance')
zamestnanecplat.head()

      jmeno  prijimeni   telefonni_cislo  cislo_zamestnance   city     plat
0     Brian       Hall  +421 949 656 098                 30  Praha  33500.0
1     Marta   Kolářová       730 456 163                 32  Praha  53000.0
2      John    Moravec       725 092 179                 33  Praha  38400.0
3  Dominika    Kopecká       722 747 626                 34  Praha  36800.0
4    Milada  Hernandez       773 373 704                 38  Praha  32600.0

In [14]:
prumerplat = zamestnanecplat.groupby(['city'])['plat'].mean()
#preco city musi byt aj v () a []?
prumerplat.head()

city
Liberec    43775.000000
Plzen      44792.857143
Praha      43295.238095
Name: plat, dtype: float64

In [15]:
print('Employees table shape:', zamestnanci.shape)
print('Salaries table shape:', platy.shape)
print('Employee-Salary table shape:', zamestnanecplat.shape)

Employees table shape: (56, 5)
Salaries table shape: (43, 2)
Employee-Salary table shape: (43, 6)

In [16]:
vykazy = pandas.read_csv('vykazy.csv')

In [18]:
hodiny = vykazy.groupby(['project'])['hours'].sum()
hodiny.head()

project
F30    21.5
JL9     2.1
TE1    16.0
W05    30.5
YLI    31.0
Name: hours, dtype: float64

In [20]:
hodiny

project
F30    21.5
JL9     2.1
TE1    16.0
W05    30.5
YLI    31.0
Name: hours, dtype: float64